package com.iqbal.gurmukhikeyboard50

object PunjabiNumberConverter {
    private val numbersMap = mapOf(
        0 to "ਸਿਫ਼ਰ", 1 to "ਇੱਕ", 2 to "ਦੋ", 3 to "ਤਿੰਨ", 4 to "ਚਾਰ", 5 to "ਪੰਜ", 6 to "ਛੇ", 7 to "ਸੱਤ", 8 to "ਅੱਠ", 9 to "ਨੌ",
        10 to "ਦਸ", 11 to "ਗਿਆਰਾਂ", 12 to "ਬਾਰਾਂ", 13 to "ਤੇਰਾਂ", 14 to "ਚੌਦਾਂ", 15 to "ਪੰਦਰਾਂ", 16 to "ਸੋਲਾਂ", 17 to "ਸਤਾਰਾਂ", 18 to "ਅਠਾਰਾਂ", 19 to "ਉਨੀ",
        20 to "ਵੀਹ", 21 to "ਇੱਕੀ", 22 to "ਬਾਈ", 23 to "ਤੇਈ", 24 to "ਚੌਵੀ", 25 to "ਪੰਚੀ", 26 to "ਛੱਬੀ", 27 to "ਸਤਾਈ", 28 to "ਅਠਾਈ", 29 to "ਉਨੱਤੀ",
        30 to "ਤੀਹ", 31 to "ਇਕੱਤੀ", 32 to "ਬੱਤੀ", 33 to "ਤੈਂਤੀ", 34 to "ਚੌਂਤੀ", 35 to "ਪੈਂਤੀ", 36 to "ਛੱਤੀ", 37 to "ਸੈਂਤੀ", 38 to "ਅਠੱਤੀ", 39 to "ਉਨਤਾਲੀ",
        40 to "ਚਾਲੀ", 41 to "ਇਕਤਾਲੀ", 42 to "ਬਿਆਲੀ", 43 to "ਤਾਲੀ", 44 to "ਚੁਤਾਲੀ", 45 to "ਪੈਤਾਲੀ", 46 to "ਛਿਆਲੀ", 47 to "ਸੰਤਾਲੀ", 48 to "ਅਠਤਾਲੀ", 49 to "ਉਣਵੰਜਾ",
        50 to "ਪੰਜਾਹ", 51 to "ਇਕਵੰਜਾ", 52 to "ਬਾਵੰਜਾ", 53 to "ਤਰਵੰਜਾ", 54 to "ਚੌਵੰਜਾ", 55 to "ਪਚਵੰਜਾ", 56 to "ਛਪੰਜਾ", 57 to "ਸਤਵੰਜਾ", 58 to "ਅਠਵੰਜਾ", 59 to "ਉਣਾਹਟ",
        60 to "ਸੱਠ", 61 to "ਇਕਾਹਟ", 62 to "ਬਾਹਟ", 63 to "ਤਰੇਹਟ", 64 to "ਚੌਂਹਟ", 65 to "ਪੈਂਹਟ", 66 to "ਛਿਆਹਟ", 67 to "ਸਤਾਹਟ", 68 to "ਅਠਾਹਟ", 69 to "ਉਨੱਤਰ",
        70 to "ਸੱਤਰ", 71 to "ਇਕੱਤਰ", 72 to "ਬਹੱਤਰ", 73 to "ਤਿਹੱਤਰ", 74 to "ਚੌਹੱਤਰ", 75 to "ਪਚੱਤਰ", 76 to "ਛਿਹੱਤਰ", 77 to "ਸਤੱਤਰ", 78 to "ਅਠੱਤਰ", 79 to "ਉਨਾਸੀ",
        80 to "ਅੱਸੀ", 81 to "ਇਕਿਆਸੀ", 82 to "ਬਿਆਸੀ", 83 to "ਤਿਰਾਸੀ", 84 to "ਚੌਰਾਸੀ", 85 to "ਪਚਾਸੀ", 86 to "ਛਿਆਸੀ", 87 to "ਸਤਾਸੀ", 88 to "ਅਠਾਸੀ", 89 to "ਉਨਾਨਵੇਂ",
        90 to "ਨੱਬੇ", 91 to "ਇਕਾਨਵੇਂ", 92 to "ਬਾਨਵੇਂ", 93 to "ਤਿਰਾਨਵੇਂ", 94 to "ਚੌਰਾਨਵੇਂ", 95 to "ਪਚਾਨਵੇਂ", 96 to "ਛਿਆਨਵੇਂ", 97 to "ਸਤਾਨਵੇਂ", 98 to "ਅਠਾਨਵੇਂ", 99 to "ਨੜਿੰਨਵੇਂ",
        100 to "ਸੌ"
    )

    fun convert(numberStr: String): String? {
        val n = numberStr.toIntOrNull() ?: return null
        return numbersMap[n]
    }
}
